zimbora/esp32-BLE112/src/esp32-BLE112.cpp

#include "esp32-BLE112.h"

extern HardwareSerial *ble;
uint8_t command[MAX_PACKET_SIZE+HEADER_SIZE];
uint8_t response[MAX_PACKET_SIZE+HEADER_SIZE];
uint8_t response_size = 0;

uint8_t inc = 0;
uint8_t gpio_hw_reset = -1;
packet msg;
uint16_t connection = 0;
uint8_t i = 0;
struct Module module{
  0,
  0,
  0,
  0,
  0,
  0,
  0
};

struct Scan scan;

struct services service[MAX_SERVICES];
struct characteristics char_[MAX_CHARACTERISTICS];
struct descriptors desc_[MAX_DESCRIPTORS];
uint8_t s_index = 0;
uint8_t c_index = 0;

BLE112::BLE112(uint32_t baudrate,uint8_t gpio){
  gpio_hw_reset = gpio;
  ble->begin(baudrate,SERIAL_8N1,27,14);
  pinMode(gpio_hw_reset,OUTPUT);
	digitalWrite(gpio_hw_reset, HIGH);
}

bool BLE112::initModule(){
  uint32_t timeout = millis()+5000;

  while(!hello() && timeout > millis()){
    delay(2000);
    hardwareReset();
  }

  slave.battery = 0;
  slave.rssi = 0xFF;
  slave.connected = false;

  if(timeout < millis())
    return false;
  else return true;
}

bool BLE112::set_callback(void(*parseEvents)(uint16_t,uint8_t*,uint8_t)){
  if(parse_rcv_data) return false; // allready defined

  parse_rcv_data = parseEvents; // define it

  return true;
}

bool BLE112::findMac(uint8_t* mac, uint32_t timeout){
  timeout += millis();
  scan.mac_found = false;
  Serial.print("discover mac: ");
  PrintHex8(mac,6);
  memcpy(scan.discover,mac,6);
  discover(1);
  while(timeout > millis() && !scan.mac_found){
    checkMessages();
  }
  endProcedure(1);
  return scan.mac_found;
}

bool BLE112::findMac(uint8_t* mac, uint32_t timeout, uint8_t mode){
  timeout += millis();
  scan.mac_found = false;
  Serial.print("discover mac: ");
  PrintHex8(mac,6);
  memcpy(scan.discover,mac,6);
  discover(mode);
  while(timeout > millis() && !scan.mac_found){
    checkMessages();
  }
  endProcedure(mode);
  return scan.mac_found;
}


uint8_t BLE112::softwareReset(){
  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = 0x09; // FW upgrade
  msg.cmd = 0x00;
  msg.data[0] = 0;

  sendCommand(WAIT_RESPONSE,1000);

  return true;
}

void BLE112::hardwareReset(){
  //Disable BLE module power -> bit6: 0
	digitalWrite(gpio_hw_reset, LOW);

  delay(500);

  //Enable BLE module power -> bit6: 1
  digitalWrite(gpio_hw_reset, HIGH);

  delay(1000);

}

void BLE112::checkMessages(){
  readCommand(0);
  return;
}

bool BLE112::hello(){

  msg.length = HEADER_SIZE;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_SYSTEM;
  msg.cmd = 0x01; // Message ID

  return sendCommand(WAIT_RESPONSE,1000);
}

void BLE112::list_characteristics(){
  //#ifdef BLE_DEBUG
  uint8_t i = 0;
  while(i<c_index){
    Serial.printf("type: %d \n",char_[i].type);
    Serial.printf("permissions: %d \n",char_[i].permissions);
    Serial.printf("handle: %d \n",char_[i].handle);
    Serial.printf("uuid: %x %x \n",(uint8_t)(char_[i].uuid>>8),(uint8_t)char_[i].uuid);
    i++;
  }
  //#endif
}

void BLE112::get_all_characteristics(){
  uint8_t i = 0;
  while(i<MAX_SERVICES){
    #ifdef BLE_DEBUG
    Serial.print("service: ");
    PrintHex8(service[i].id,service[i].len);
    Serial.println();
    #endif
    if(service[i].len != 0)
      readByType(service[i].init_handle,service[i].end_handle,service[i].id,service[i].len);
    i++;
  }
}

void BLE112::read_all_characteristics(){
  uint8_t i = 0;
  while(i<c_index){
    if(is_readable(char_[i].permissions)){
      #ifdef BLE_DEBUG
      Serial.printf("reading uuid: %x %x \n",(uint8_t)(char_[i].uuid>>8),(uint8_t)char_[i].uuid);
      #endif
      readByHandle(char_[i].handle);
    }
    i++;
  }
}

bool BLE112::char_handle_exists(uint16_t handle){
  uint8_t i = 0;
  while(i<c_index){
    if(char_[i].handle == handle)
      return true;
    i++;
  }
  return false;
}


bool BLE112::char_uuid_exists(uint16_t uuid){
  uint8_t i = 0;
  while(i<c_index){
    if(char_[i].uuid == uuid){
      #ifdef BLE_DEBUG
      Serial.printf("uuid exists: %d \n",uuid);
      #endif
      return true;
    }
    i++;
  }
  return false;
}

uint16_t BLE112::get_permission(uint16_t uuid){
  uint8_t i = 0;
  while(i<c_index){
    if(char_[i].uuid == uuid){
      is_readable(char_[i].permissions);
      is_write_no_response(char_[i].permissions);
      is_writable(char_[i].permissions);
      has_notify(char_[i].permissions);
      has_indicate(char_[i].permissions);
      has_reliable_write(char_[i].permissions);
      return char_[i].permissions;
    }
    i++;
  }
  return 0;
}

uint16_t BLE112::get_handle(uint16_t uuid){
  uint8_t i = 0;
  while(i<c_index){
    if(char_[i].uuid == uuid){
      return char_[i].handle;
    }
    i++;
  }
  return 0;
}


bool BLE112::getSystemInfo(){

  msg.length = HEADER_SIZE;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_SYSTEM;
  msg.cmd = 0x08;

  return sendCommand(WAIT_RESPONSE,1000);
}


bool BLE112::indicate(uint16_t uuid){
  if(char_uuid_exists(uuid)){
    uint16_t handle = get_handle(uuid);
    uint8_t data[] = {0x02, 0x00}; // indicate
    if(writeCommand(handle+1,data,2)){
      delay(200);
      checkMessages();
      return true;
    }
  }
  return false;
}


bool BLE112::indicateConfirm(){

  ble->flush();
  readCommand(0); // Empty rx buffer

  command[0] = 0; // message type
  command[1] = 1; // payload
  command[2] = 4; // Message class: Attribute Client
  command[3] = 7; // Message ID
  command[4] = connection;

  #ifdef BLE_DEBUG
  Serial.print("indicate confirm command: ");
  PrintHex8(command,5);
  #endif
  ble->write(command, 5);
  ble->flush();
}


bool BLE112::notify (uint16_t uuid){
  if(char_uuid_exists(uuid)){
    uint16_t handle = get_handle(uuid);
    uint8_t data[] = {0x01, 0x00}; // notify
    Serial.printf("handle: %d \n",handle+1);
    return writeCommand(handle+1,data,2);
  }else{
    Serial.printf("uuid: %x not found\n",uuid);
  }
  return false;
}

bool BLE112::notify_handle (uint16_t handle){

  uint8_t i = 0;
  while(i<c_index){
    if(char_[i].handle == handle){
      Serial.println("handle found");
      if(!has_notify(char_[i].permissions))
        return false;
      else break;
    }
    i++;
  }

  uint8_t data[] = {0x01, 0x00}; // notify
  return writeCommand(handle+1,data,2);
}

// use it write on an attribute
bool BLE112::write_attribute(uint16_t uuid,uint8_t* data, uint8_t len){
  if(char_uuid_exists(uuid)){
    uint16_t handle = get_handle(uuid);
    return attributeWrite(handle,data,len);
  }
  return false;
}

// use it for indicate and notify
bool BLE112::write_command(uint16_t uuid,uint8_t* data, uint8_t len){
  if(char_uuid_exists(uuid)){
    uint16_t permission = get_permission(uuid);
    if(is_writable(permission) || is_write_no_response(permission) || has_reliable_write(permission)){
      uint16_t handle = get_handle(uuid);
      return writeCommand(handle,data,len);
    }
  }
  return false;
}

bool BLE112::read_uuid(uint16_t uuid){
  if(char_uuid_exists(uuid)){
    uint16_t handle = get_handle(uuid);
    return readByHandle(handle);
  }
  return false;
}


