zimbora/esp32-BLE112/src/esp32-BLE112.cpp
// --- Communicate with external BLE devices ---
/*
  Attribute Write
  This command can be used to write an attributes value on a remote device. In order to write the value of an
  attribute a connection must exists and you need to know the handle of the attribute you want to write. Bluetooth
  A successful attribute write will be acknowledged by the remote device and this will generate an event
  attclient_procedure_completed. The acknowledgement should happen within a 30 second window or otherwise
  the Bluetooth connection will be dropped.
  The data payload for the Attribute Write command can be up to 20 bytes.
*/
bool BLE112::attributeWrite(uint16_t atthandle,uint8_t* data, uint8_t size){
  uint8_t len = HEADER_SIZE+4+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = len-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_ATTRIBUTE_WRITE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)atthandle;
  msg.data[2] = (uint8_t)(atthandle>>8);
  msg.data[3] = size;

  i = 0;
  while(i<size){
    msg.data[4+i] = data[i];
    i++;
  }


  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
  return false;
}

/*
  Execute Write
  This command can be used to execute or cancel a previously queued prepare_write command on a remote
  device.
*/
bool BLE112::executeWrite(uint8_t commit){

  msg.length = HEADER_SIZE+2;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_EXECUTE_WRITE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)commit;

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
}

/*
  Find By Type Value

  This command can be used to find specific attributes on a remote device based on their 16-bit UUID value and
  value. The search can be limited by a starting and ending handle values.
  The command returns the handles of all attributes matching the type (UUID) and value
*/
bool BLE112::findByTypeValue(uint16_t uuid,uint16_t start, uint16_t end,uint8_t* value, uint8_t size){
  uint8_t len = HEADER_SIZE+8+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length - HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_REMOTE_FIND_BY_TYPE_VALUE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)start;
  msg.data[2] = (uint8_t)(start>>8);
  msg.data[3] = (uint8_t)end;
  msg.data[4] = (uint8_t)(end>>8);
  msg.data[5] = (uint8_t)uuid;
  msg.data[6] = (uint8_t)(uuid>>8);
  msg.data[7] = (uint8_t)size;

  i = 0;
  while(i<size){
    msg.data[8+i] = value[i];
    i++;
  }

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
  return false;
}

/*
  Find Information
  This command is used to discover attribute handles and their types (UUIDs) in a given handle range
*/
bool BLE112::findInformation(uint16_t start, uint16_t end){
  uint8_t len = HEADER_SIZE+5;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length - HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_READ_REMOTE_FIND_INFORMATION;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)start;
  msg.data[2] = (uint8_t)(start>>8);
  msg.data[3] = (uint8_t)end;
  msg.data[4] = (uint8_t)(end>>8);

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
}

/*
Indicate Confirm
This command can be used to send a acknowledge a received indication from a remote device. This function
allows the application to manually confirm the indicated values instead of the smart stack Bluetooth
automatically doing it. The benefit of this is extra reliability since the application can for example store the
received value on the flash memory before confirming the indication to the remote device.
*/
/*
bool BLE112::indicateConfirm(){

  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_INDICATE_CONFIRM;
  msg.data[0] = connection;

  return sendCommand(WAIT_RESPONSE,1000);
}
*/

/*
  Prepare Write
  This command will send a prepare write request to a remote device for queued writes. Queued writes can for
  example be used to write large attribute values by transmitting the data in chunks using prepare write
  command.
  Once the data has been transmitted with multiple prepare write commands the write must then be executed or
  canceled with Execute Write command, which if acknowledged by the remote device triggers a Procedure
  Completed event.
*/
bool BLE112::prepareWrite(uint16_t atthandle,uint16_t offset,uint8_t* data, uint8_t size){
  uint8_t len = HEADER_SIZE+6+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = len-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_PREPARE_WRITE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)atthandle;
  msg.data[2] = (uint8_t)(atthandle>>8);
  msg.data[1] = (uint8_t)offset;
  msg.data[2] = (uint8_t)(offset>>8);
  msg.data[3] = size;

  i = 0;
  while(i<size){
    msg.data[4+i] = data[i];
    i++;
  }

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
  return false;
}


/*
  Read By Group Type
  This command reads the value of each attribute of a given type and in a given handle range.
  The command is typically used for primary (UUID: 0x2800) and secondary (UUID: 0x2801) service discovery.
  Discovered services are reported by Group Found event.
  Finally when the procedure is completed a Procedure Completed event is generated.
*/
bool BLE112::readByGroupType(uint16_t start, uint16_t end,uint8_t* uuid, uint8_t size){
  uint8_t len = HEADER_SIZE+6+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  s_index = 0;

