zimbora/esp32-BLE112/src/esp32-BLE112.cpp
  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length - HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_REMOTE_READ_BY_GROUP_TYPE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)start;
  msg.data[2] = (uint8_t)(start>>8);
  msg.data[3] = (uint8_t)end;
  msg.data[4] = (uint8_t)(end>>8);
  msg.data[5] = (uint8_t)size;

  i = 0;
  while(i<size){
    msg.data[6+i] = uuid[i];
    i++;
  }

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
  return false;
}

/*
  Read By Handle
  This command reads a remote attribute's value with the given handle. Read by handle can be used to read
  attributes up to 22 bytes long.
  For longer attributes command must be used.
*/
bool BLE112::readByHandle(uint16_t atthandle){
  uint8_t len = HEADER_SIZE+3;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_READ_REMOTE_BY_HANDLE;


  msg.data[0] = connection;
  msg.data[1] = (uint8_t)atthandle;
  msg.data[2] = (uint8_t)(atthandle>>8);

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,1000); // in case of acknowledge by remote device
  }
}

/*
  Read By Type
  The command reads the value of each attribute of a given type (UUID) and in a given attribute handle range.
  The command can for example be used to discover the characteristic declarations (UUID: 0x2803) within a
  service.
*/
bool BLE112::readByType(uint16_t start, uint16_t end,uint8_t* uuid, uint8_t size){
  uint8_t len = HEADER_SIZE+6+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  c_index = 0;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length - HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_READ_REMOTE_BY_TYPE;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)start;
  msg.data[2] = (uint8_t)(start>>8);
  msg.data[3] = (uint8_t)end;
  msg.data[4] = (uint8_t)(end>>8);
  msg.data[5] = (uint8_t)size;

  i = 0;
  while(i<size){
    msg.data[6+i] = uuid[size-i-1];
    i++;
  }

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_ATTCLIENT_PROCEDURE_COMPLETED,3000); // in case of acknowledge by remote device
  }
  return false;
}

/*
  Read Long

  This command can be used to read long attribute values, which are longer than 22 bytes and cannot be read
  with a simple Read by Handle command.
  The command starts a procedure, where the client first sends a normal read command to the server and if the
  returned attribute value length is equal to MTU, the client will send further read long read requests until rest of
  the attribute is read.
*/
bool BLE112::readLong(){
  return true;
}

/*
  Read Multiple

  This command can be used to read multiple attributes from a server
*/
bool BLE112::readMultiple(){
  return true;
}

/*
  Write Command
  Writes the value of a remote devices attribute. The handle and the new value of the attribute are gives as
  parameters.
*/
bool BLE112::writeCommand(uint16_t atthandle,uint8_t* data, uint8_t size){
  uint8_t len = HEADER_SIZE+4+size;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = len-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_ATTCLIENT;
  msg.cmd = BLE_REMOTE_WRITE_COMMAND;

  msg.data[0] = connection;
  msg.data[1] = (uint8_t)atthandle;
  msg.data[2] = (uint8_t)(atthandle>>8);
  msg.data[3] = size;

  i = 0;
  while(i<size){
    msg.data[4+i] = data[i];
    i++;
  }


  return sendCommand(WAIT_RESPONSE,1000);

}

// --- --- ---

// --- Connection methods ---

/*
  Disconnect
  This command disconnects an active connection. Bluetooth
  When link is disconnected a Disconnected event is produced.
*/
bool BLE112::connectionClose(){
  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_CONNECTION;
  msg.cmd = BLE_REMOTE_DISCONNECT;
  msg.data[0] = connection;

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_DISCONNECT,1000);
  }else return false;
}

/*
  Get Rssi
  This command returns the Receiver Signal Strength Indication (RSSI) related to the connection referred to by
  the connection handle parameter. If the connection is not open, then the RSSI value returned in the response
  packet will be 0x00, while if the connection is active, then it will be some negative value (2's complement form
  between 0x80 and 0xFF and never 0x00). Note that this command also returns an RSSI of 0x7F if you request
  RSSI on an invalid/unsupported handle.
*/
bool BLE112::getRSSI(int8_t* rssi){
  msg.length = HEADER_SIZE;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_CONNECTION;
  msg.cmd = BLE_REMOTE_RSSI;

  if(sendCommand(WAIT_RESPONSE,1000)){
    *rssi = response[5];
    return true;
  }else return false;
}

/*
  Get Status
  This command returns the status of the given connection.
  Status is returned in a event.
*/
bool BLE112::getStatus(uint8_t* status){
  msg.length = HEADER_SIZE;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_CONNECTION;
  msg.cmd = BLE_REMOTE_CONNECTION_STATUS;

  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_CONNECTION_STATUS,1000);
  }else return false;
}

/* NOT Implemented
  Slave Latency Disable
  This command temporarily enables or disables slave latency
*/
bool BLE112::slaveLatencyDisable(){
  return true;
}

/* NOT Implemented
  Update
  This command updates the connection parameters of a given connection. The parameters have the same
  meaning and follow the same rules as for the GAP class command: Connect Direct.
  If this command is issued at a master device, it will send parameter update request to the link layer. Bluetooth
  On the other hand if this command is issued at a slave device, it will send L2CAP connection parameter update
  request to the master, which may either accept or reject it.
  Silicon Labs Page of 90 227
  It will take an amount of time corresponding to at least six times the current connection interval before the new
  connection parameters will become active.
*/
bool BLE112::update(){


