zimbora/esp32-BLE112/src/esp32-BLE112.cpp
  return true;
}


/* NOT Implemented
  Version Update
  This command requests a version exchange of a given connection.
*/
bool BLE112::versionUpdate(){

  // wait event

  return true;
}

// --- GAP methods ---
/*
  Connect Direct
  This command will start the GAP direct connection establishment procedure to a dedicated Smart Bluetooth
  device.
  The module will enter a state where it continuously scans for the connectable advertisement packets Bluetooth
  from the remote device which matches the Bluetooth address gives as a parameter. Upon receiving the
  advertisement packet, the module will send a connection request packet to the target device to imitate a
  Bluetooth connection. A successful connection will bi indicated by a event. Status
  If the device is configured to support more than one connection, the smallest connection interval which is
  divisible by maximum_connections * 2.5ms will be selected. Thus, it is important to provide minimum and
  maximum connection intervals so that such a connection interval is available within the range.
  The connection establishment procedure can be cancelled with End Procedure command.

  0: gap_address_type_public
  1: gap_address_type_random
*/
bool BLE112::connectDirect(uint8_t* address){
  uint8_t addr_type = scan.address_type;
  uint16_t conn_interval_min = 32;
  uint16_t conn_interval_max = 48;
  uint16_t timeout = 100;
  uint16_t latency = 0;
  // wait event

  uint8_t len = HEADER_SIZE+15;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = len-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_REMOTE_CONNECT;

  i = 0;
  while(i<6){
    msg.data[i] = address[5-i];
    i++;
  }
  msg.data[i++] = addr_type;
  msg.data[i++] = conn_interval_min;
  msg.data[i++] = (uint8_t)(conn_interval_min>>8);
  msg.data[i++] = conn_interval_max;
  msg.data[i++] = (uint8_t)(conn_interval_max>>8);
  msg.data[i++] = timeout;
  msg.data[i++] = (uint8_t)(timeout>>8);
  msg.data[i++] = latency;
  msg.data[i++] = (uint8_t)(latency>>8);

  Serial.println("\nconnect to: ");
  PrintHex8_inverted(&msg.data[0],6);
  if(sendCommand(WAIT_RESPONSE,1000)){
    //return waitEvent(BLE_CLASS_ID_CONNECTION,BLE_EVENT_CONNECTION_STATUS,3000); // in case of acknowledge by remote device
    return waitEvent(BLE_EVENT_CONNECTION_STATUS,3000); // in case of acknowledge by remote device
  }
  return false;
}

bool BLE112::connectSelective(){
  uint16_t conn_interval_min = 60;
  uint16_t conn_interval_max = 76;
  uint16_t timeout = 100;
  uint16_t latency = 0;
  // wait event

  uint8_t len = HEADER_SIZE+9;
  if(len>MAX_PACKET_SIZE)
    return false;

  msg.length = len;
  msg.mt = BLE_MESSAGE;
  msg.ll = len-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_REMOTE_CONNECT_SELECTIVE;

  msg.data[i++] = conn_interval_min;
  msg.data[i++] = (uint8_t)(conn_interval_min>>8);
  msg.data[i++] = conn_interval_max;
  msg.data[i++] = (uint8_t)(conn_interval_max>>8);
  msg.data[i++] = timeout;
  msg.data[i++] = (uint8_t)(timeout>>8);
  msg.data[i++] = latency;
  msg.data[i++] = (uint8_t)(latency>>8);


  if(sendCommand(WAIT_RESPONSE,1000)){
    return waitEvent(BLE_EVENT_CONNECTION_STATUS,1000); // in case of acknowledge by remote device
  }
  return false;
}


// --- --- ---
/*
  Discover
  This command starts the GAP discovery procedure to scan for advertising devices i.e. to perform a device
  discovery.
  Scanning parameters can be configured with the Set Scan Parameters command before issuing this command.
  To cancel on an ongoing discovery process use the End Procedure command.

  mode:
    - 0: gap_discover_limited
    - 1: gap_discover_generic
    - 2: gap_discover_observation
*/
bool BLE112::discover(uint8_t mode){
  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_DISCOVER;
  msg.data[0] = mode;

  return sendCommand(WAIT_RESPONSE,1000);
}

/*
  End Procedure
  This command ends the current GAP discovery procedure and stop the scanning of advertising devices.
*/
bool BLE112::endProcedure(uint8_t mode){
  msg.length = HEADER_SIZE;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_END_PROCEDURE;

  return sendCommand(WAIT_RESPONSE,1000);
}

/* NOT Implemented
  Set Adv Data
  This commands set advertisement or scan response data used in the advertisement and scan response
  packets. The command allows application specific data to be broadcasts either in advertisement or scan
  response packets.
  The data set with this command is only used when the GAP discoverable mode is set to gap_user_data.
  Notice that advertisement or scan response data must be formatted in accordance to the Bluetooth Core
  Specification. See BLUETOOTH SPECIFICATION Version 4.0 [Vol 3 - Part C - Chapter 11].
*/
bool BLE112::setAdvData(){
  return false;
}

/* NOT Implemented
  Set Directed Connectable Mode
  This command sets device to Directed Connectable mode.
  In this mode the device uses fast advertisement procedure for the first 1.28 seconds, after which the device
  enters a non-connectable mode. If the device implements the Peripheral Preferred Connection Parameters
  characteristic in its GAP service the parameters defined by this characteristic will be used for the connection.
*/
bool BLE112::setDirConnectableMode(){
  return false;
}

/*
  Set Initiating Con Parameters
  This command sets the scan parameters for Initiating State which affect for establishing BLE connection
*/
bool BLE112::setInitiatingConParameters(){
  return false;
}

/*
  Set Mode
  This command configures the current GAP discoverability and connectability modes. It can be used to enable
  advertisements and/or allow connection. The command is also meant to fully stop advertising, when using
  gap_non_discoverable and gap_non_connectable.

  GAP DISCOVERABLE MODE
  0 - gap_non_discoverable
  1 - gap_limited_discoverable
  2 - gap_general_discoverable
  3 - gap_broadcast
  4 - gap_user_data
  0x80 - gap_enhanced_broadcasting

