zimbora/esp32-BLE112/src/esp32-BLE112.cpp
  GAP Connectable Mode
  0 - gap_non_connectable
  1 - gap_directed_connectable
  2 - gap_undirected_connectable
  3 - gap_scannable_non_connectable
*/
bool BLE112::setMode(uint8_t discover, uint8_t connect){
  msg.length = HEADER_SIZE+2;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_DISCOVER;
  msg.data[0] = discover;
  msg.data[1] = connect;

  return sendCommand(WAIT_RESPONSE,1000);
}



/*
  Set Privacy Flags
  This command sets GAP central/peripheral privacy flags.
  By setting for example peripheral_privacy to 1, the stack will automatically generate a resolvable Bluetooth
  random private address for the advertising packets every time the command is used to enter Set Mode
  advertising mode.
  By setting privacy mode to 2, the stack will generate a resolvable random private address on Bluetooth
  demand. If peripherial_privacy is set to 2 additionally is called with the current Discoverable and Set Mode
  Connectable parameters. Setting up new mode by command does not change generated address

  peripheral_privacy
  2: change peripheral private address on demand
  1: enable peripheral privacy
  0: disable peripheral privacy
  Any other value will have no effect on flag

  central_privacy
  2: change central private address on demand
  1: enable central privacy
  0: disable central privacy
  Any other value will have no effect on flag
*/
bool BLE112::setPrivacyFlags(uint8_t peripheral_privacy, uint8_t central_privacy){
  msg.length = HEADER_SIZE+2;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_DISCOVER;
  msg.data[0] = peripheral_privacy;
  msg.data[1] = central_privacy;

  return sendCommand(WAIT_RESPONSE,1000);
}

/*
Set Scan Parameters
This command sets the scan parameters which affect how other Smart devices are discovered.
*/
bool BLE112::setScanParameters(uint16_t scan_interval, uint16_t scan_window, uint8_t active){
  msg.length = HEADER_SIZE+5;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_GAP;
  msg.cmd = BLE_SET_SCAN_PARAMETERS;
  msg.data[0] = scan_interval;
  msg.data[1] = (uint8_t)(scan_interval>>8);
  msg.data[2] = scan_window;
  msg.data[3] = (uint8_t)(scan_window>>8);
  msg.data[4] = active;

  return sendCommand(WAIT_RESPONSE,1000);
}

/* NOT Implemented
  Set Filtering
  This command can be used to set scan, connection, and advertising filtering parameters based on the local
  devices white list. See also Whitelist Append command.
*/
bool BLE112::setFiltering(){
  return true;
}

/*
  Set RXpower
  This command sets the radio receiver (RX) sensitivity to either high (default) or standard. The exact sensitivity
  value is dependent on the used hardware (refer to the appropriate data sheet).

  // gain
  0: standard gain
  1: high gain (default)
*/
bool BLE112::setRXgain(uint8_t power){
  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_HARDWARE;
  msg.cmd = BLE_SET_RXGAIN;
  msg.data[0] = power;

  return sendCommand(WAIT_RESPONSE,1000);
}

/*
  Set TXpower
  Re-configure TX output power

  0 to 15 with the BLE112 and the BLED112
*/
bool BLE112::setPower(uint8_t power){
  msg.length = HEADER_SIZE+1;
  msg.mt = BLE_MESSAGE;
  msg.ll = msg.length-HEADER_SIZE;
  msg.cid = BLE_CLASS_ID_HARDWARE;
  msg.cmd = BLE_SET_POWER;
  msg.data[0] = power;

  return sendCommand(WAIT_RESPONSE,1000);
}

// --- private ---

bool BLE112::is_readable(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("is_readable");
  #endif
  return (permission & 0x02);
}

bool BLE112::is_write_no_response(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("is_write_no_response");
  #endif
  return (permission & 0x04) > 0;
}

bool BLE112::is_writable(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("is_writable");
  #endif
  return (permission & 0x08) > 0;
}

bool BLE112::has_notify(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("has_notify");
  #endif
  return (permission & 0x10) > 0;
}

bool BLE112::has_indicate(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("has_indicate");
  #endif
  return (permission & 0x20) > 0;
}

bool BLE112::has_reliable_write(uint8_t permission){
  #ifdef BLE_DEBUG
    Serial.println("has_reliable_write");
  #endif
  return (permission & 0x80) > 0;
}

bool BLE112::waitEvent(uint8_t class_,uint8_t event,uint16_t timeout){
  return false;
}

bool BLE112::waitEvent(uint8_t event,uint16_t timeout){
  /*
  #ifdef BLE_DEBUG
    Serial.print("data rcv: ");
    PrintHex8(response,inc);
  #endif
  */
  uint32_t time = millis() + timeout;
  while(millis() < time){
    if(ble->available()){
      readCommand(0);
      if(response[0] == 0x80 && response[3] == event)
        return true;
    }
  }
  return false;
}


bool BLE112::parseCommand(){
  if(msg.mt == response[0] && msg.cid == response[2] && msg.cmd == response[3]){
    if(response[4] == 0 && response[5] == 0){
      #ifdef BLE_DEBUG
        Serial.println("Command sent successful");
      #endif
      return true;
    }else if(response[4] != 0 || response[5] != 0){
      #ifdef BLE_DEBUG
        Serial.printf("Error sending command \n");
      #endif
      parseError((uint16_t)(response[4]<<8)|response[5]);
      return false;
    }else{
      #ifdef BLE_DEBUG
        Serial.println("msg response does not correspond to the message sent");
      #endif
      return false;
    }
  }
}


bool BLE112::parseEvent(uint8_t len){

  if( response[2] == BLE_CLASS_ID_SYSTEM && response[3] == 0x06){
    Serial.println("An error ocurred");
    parseError((uint16_t)(response[4]|(response[5]>>8)));
  }else if(response[2] == BLE_CLASS_ID_SYSTEM && response[3] == 0x00){
    Serial.println("--- ble has booted ---");
    module.major_sw_version = response[4]|(response[5]>>8);
    module.minor_sw_version = response[6]|(response[7]>>8);
    module.patch = response[8]|(response[9]>>8);
    module.build = response[10]|(response[11]>>8);
    module.ll_version = response[12]|(response[13]>>8);
    module.protocol_version = response[14];
    module.hw_version = response[15];
    #ifdef BLE_DEBUG
      Serial.printf("version: %d.%d \n",module.major_sw_version,module.minor_sw_version);
      Serial.printf("link layer version: %d \n",module.ll_version);
      Serial.printf("protocol version: %d \n",module.protocol_version);
      Serial.printf("hw version: %d \n",module.hw_version);
      Serial.println("--- --- ---");
    #endif
  }else if(response[2] == BLE_CLASS_ID_CONNECTION){

    if(response[3] == BLE_EVENT_CONNECTION_STATUS){
      Serial.println("--- Connection status ---");
      slave.connected = true;
      memcpy(slave.mac,scan.discover,6);
      switch(response[5]){
        case 0x00:
          Serial.println("Connection connected");
          break;
        case 0x01:
          Serial.println("Connection encrypted");
          break;
        case 0x02:
          Serial.println("Connection completed");
          break;
        case 0x04:
          Serial.println("Connection parameters change");
          break;
      }
    }else if(response[3] == BLE_EVENT_REMOTE_DEVICE_VERSION){
      Serial.println("--- Remote ---");
      Serial.printf("version: %d \n",response[5]);
      Serial.println("--- --- ---");
    }else if(response[3] == BLE_EVENT_DISCONNECT){
      Serial.println("Remote device has disconnected");
      slave.connected = false;
      uint16_t error = (uint16_t)(response[5]|(response[6]<<8));
      parseError(error);
    }

  }else if(response[2] == BLE_CLASS_ID_ATTCLIENT){
    if(response[3] == BLE_REMOTE_READ_BY_GROUP_TYPE){
      if(response[5] != 0 || response[6] != 0){
        Serial.println("!! Procedure BLE_REMOTE_READ_BY_GROUP_TYPE completed with error");
        uint16_t error = (uint16_t)(response[5]|(response[6]<<8));
        parseError(error);
      }else Serial.println("Procedure BLE_REMOTE_READ_BY_GROUP_TYPE completed");

    }else if (response[3] == BLE_EVENT_ATTCLIENT_GROUP_FOUND){
      if(s_index == MAX_SERVICES){
        Serial.println("Service array is full");
        return false;
      }
      Serial.println("att client group found");
      service[s_index].init_handle = (uint16_t)response[5]|(response[6]<<8);
      service[s_index].end_handle = (uint16_t)response[7]|(response[8]<<8);
      service[s_index].len = response[9];
      Serial.println();
      uint8_t i = 0;
      while(i<response[9] && i<SERVICE_SIZE){
        service[s_index].id[i] = response[10+i]; // first byte is the len
        i++;
      }
      #ifdef BLE_DEBUG
        Serial.printf("init handle: %d \n",service[s_index].init_handle);
        Serial.printf("end handle: %d \n",service[s_index].end_handle);
        Serial.print("Service: ");
        PrintHex8(&service[s_index].id[0],service[s_index].len);
        Serial.println();
      #endif
      if(s_index < MAX_SERVICES)
        s_index++;

    }else if(response[3] == BLE_EVENT_ATTCLIENT_ATTRIBUTE_VALUE){

      //#ifdef BLE_HIGH_DEBUG
      uint16_t handle = (uint16_t)response[5]|(response[6]<<8);

      #ifdef BLE_HIGH_DEBUG
        Serial.printf("type: %d \n",(uint8_t)response[7]);
      #endif

      #ifdef BLE_HIGH_DEBUG
      Serial.print("full msg: ");
      PrintHex8(&response[0],response_size);
      #endif

      #ifdef BLE_HIGH_DEBUG
      Serial.print("data rcv: ");
      PrintHex8(&response[9],response[8]);
      #endif

