zimbora/esp32-BLE112/src/esp32-BLE112.cpp
      parse_rcv_data(handle,&response[9],response[8]);

      //#endif
      memset(returned_data,0,MAX_DATA);
      memcpy(returned_data,&response[9],response[8]);

      if(c_index == MAX_CHARACTERISTICS){
        Serial.println("Characteristics array is full");
        return false;
      }
      char_[c_index].type = response[7];
      if(response[8] >= 5){
        char_[c_index].permissions = response[9];
        char_[c_index].handle = (uint16_t)response[10]|(response[11]<<8);
        char_[c_index].uuid = (uint16_t)response[12]|(response[13]<<8);
        if(!char_handle_exists(char_[c_index].handle))
          c_index++;
      }

    }else if(response[3] == BLE_ATTRIBUTE_WRITE){
      #ifdef BLE_DEBUG
        Serial.println("att client attribute write");
        Serial.printf("attribute handle: %d \n",(uint16_t)response[5]|(response[6]<<8));
        Serial.printf("type: %d",response[7]);
        Serial.print("value received: ");
        PrintHex8(&response[9],response[8]);
        Serial.println();
      #endif

    }else{
      PrintHex8(response,response[1]+2);
    }
  }else if(response[2] == BLE_CLASS_ID_GAP && response[3] == BLE_EVENT_GAP_SCAN_RESPONSE){
    //Serial.println("Scan event");
    uint8_t i = 0;
    while(i<6){
      scan.mac[i] = response[12-i-1];
      i++;
    }

    #ifdef BLE_HIGH_DEBUG
      switch(response[5]){
        case 0:
          Serial.println("Connectable adversisement packet");
          break;
        case 2:
          Serial.println("Non Connectable adversisement packet");
          break;
        case 4:
          Serial.println("Scan response packet");
          break;
        case 6:
          Serial.println("Discoverable adversisement packet");
          break;
        default: break;
      }

      PrintHex8_inverted(&response[6],6);
      Serial.print("mac: ");
      PrintHex8(scan.mac,6);

      if(response[12] == 1)
        Serial.println("address_type: random address");
      else
        Serial.println("address_type: public address");
      Serial.printf("bond: %d \n",response[13]);

      PrintHex8(&response[15],response[14]);
    #elif defined BLE_DEBUG
      //Serial.print("mac: ");
      //PrintHex8(scan.mac,6);
    #endif

    scan.rssi = response[4];
    scan.address_type = response[12];
    if ( memcmp( (const void *)scan.discover, (const void *)scan.mac, 6) == 0){
      scan.mac_found = true;
      slave.rssi = response[4];
      #ifdef BLE_HIGH_DEBUG
        Serial.print("adv packet data: ");
        PrintHex8(&response[15],response[14]);
      #endif
    }

  }else{
    Serial.println("!! EVENT NOT PARSED");
    PrintHex8(&response[0],len);
    return false;
  }

  return true;
}

// this function is always used to print debug messages.
void BLE112::PrintHex8(uint8_t *data, uint8_t length){ // prints 8-bit data in hex with leading zeroes

  for (uint8_t a = 0; a < length; a++)
  {
    if (data[a] < 0x10)
    {
      Serial.print("0");
    }
    Serial.print(data[a], HEX);
    Serial.print(" ");
  }
  Serial.println();
}

// this function is always used to print debug messages.
void BLE112::PrintHex8_inverted(uint8_t *data, uint8_t length){ // prints 8-bit data in hex with leading zeroes

  for (int16_t a = length-1; a >= 0; a--)
  {
    if (data[a] < 0x10)
    {
      Serial.print("0");
    }
    Serial.print(data[a], HEX);
    Serial.print(" ");
  }
  Serial.println();
}

// sendCommand
bool BLE112::sendCommand(bool waitResponse, uint32_t wait){

  ble->flush();
  readCommand(0); // Empty rx buffer

  uint8_t i = 0;
  command[0] = msg.length;
  command[1] = msg.mt;
  command[2] = msg.ll;
  command[3] = msg.cid;
  command[4] = msg.cmd;
  while(i<msg.ll){
    command[5+i] = msg.data[i];
    i++;
  }
  #ifdef BLE_DEBUG
    Serial.print("write command: ");
    PrintHex8(&command[0],command[0]+1);
  #endif
  ble->write(command, command[0]+1);
  ble->flush();

  delay(100);
  if(waitResponse)
    return readCommand(wait);
  return true;
}

// readCommand
bool BLE112::readCommand(uint32_t wait){
  memset(response,0,MAX_PACKET_SIZE+HEADER_SIZE);
  inc = 0;
  uint32_t timeout = millis() + wait;
  do{
    response_size = 0;
    if(ble->available()){
      response_size = 0;
      response[response_size++] = ble->read();
      uint16_t size = ble->peek()+4;
      if(size < (MAX_PACKET_SIZE+HEADER_SIZE)){
        while(response_size < size && response_size < (MAX_PACKET_SIZE+HEADER_SIZE)){
          response[response_size++] = ble->read();
        }
        #ifdef BLE_HIGH_DEBUG
          Serial.print("command: ");
          PrintHex8(response,size);
        #endif
        if(response[0] == 0x80){
          if(!parseEvent(response_size)) return false;
          else return true;
        }else return parseCommand();
      }else{
        while(ble->available()) ble->read();
        return false;
      }
    }
  } while(timeout > millis());
  return false;
}

// parseError
void BLE112::parseError(uint16_t e){
  Serial.printf("error: %x -> ", e);
  switch(e){
    case InvalidParameter:
      Serial.println("InvalidParameter");
      break;
    case DeviceWrongState:
      Serial.println("DeviceWrongState");
      break;
    case OutOfMemory:
      Serial.println("OutOfMemory");
      break;
    case FeatureNotImplemented:
      Serial.println("FeatureNotImplemented");
      break;
    case CommandNotRecognize:
      Serial.println("CommandNotRecognize");
      break;
    case Timeout:
      Serial.println("Timeout");
      break;
    case NotConnected:
      Serial.println("NotConnected");
      break;
    case flow:
      Serial.println("flow");
      break;
    case UserAttribute:
      Serial.println("UserAttribute");
      break;
    case InvalidLicenseKey:
      Serial.println("InvalidLicenseKey");
      break;
    case CommandTooLon:
      Serial.println("CommandTooLon");
      break;
    case OutofBond:
      Serial.println("OutofBond");
      break;
    case AuthenticationFailure:
      Serial.println("AuthenticationFailure");
      break;
    case PinorKeyMissing:
      Serial.println("PinorKeyMissing");
      break;
    case MemoryCapacityExceeded:
      Serial.println("MemoryCapacityExceeded");
      break;
    case ConnectionTimeout:
      Serial.println("ConnectionTimeout");
      break;
    case ConnectionLimitExceeded:
      Serial.println("ConnectionLimitExceeded");
      break;
    case CommandDisallowed:
      Serial.println("CommandDisallowed");
      break;
    case InvalidCommandParameter:
      Serial.println("InvalidCommandParameter");
      break;
    case RemoteUserTerminatedConnection:
      Serial.println("RemoteUserTerminatedConnection");
      break;
    case ConnectionTerminatedbyLocalHost:
      Serial.println("ConnectionTerminatedbyLocalHost");
      break;
    case LLResponseTimeout:
      Serial.println("LLResponseTimeout");
      break;
    case LLInstantPassed:
      Serial.println("LLInstantPassed");
      break;
    case ControllerBus:
      Serial.println("ControllerBus");
      break;
    case UnacceptableConnectionInterval:
      Serial.println("UnacceptableConnectionInterval");
      break;
    case DirectedAdvertisingTimeout:
      Serial.println("DirectedAdvertisingTimeout");
      break;
    case MICFailure:
      Serial.println("MICFailure");
      break;
    case ConnectionFailedtobeEstablished:
      Serial.println("ConnectionFailedtobeEstablished");
      break;
    case PasskeyEntryFailed:
      Serial.println("PasskeyEntryFailed");
      break;
    case OOBDataisnotavailable:
      Serial.println("OOBDataisnotavailable");
      break;
    case AuthenticationRequirements:
      Serial.println("AuthenticationRequirements");
      break;
    case ConfirmValueFailed:
      Serial.println("ConfirmValueFailed");
      break;
    case PairingNotSupported:
      Serial.println("PairingNotSupported");
      break;
    case EncryptionKeySize:
      Serial.println("EncryptionKeySize");
      break;
    case CommandNotSupported:
      Serial.println("CommandNotSupported");
      break;
    case UnspecifiedReason:
      Serial.println("UnspecifiedReason");
      break;
    case RepeatedAttempt:
      Serial.println("RepeatedAttempt");
      break;
    case InvalidParameters:
      Serial.println("InvalidParameters");
      break;
    case InvalidHandle:
      Serial.println("InvalidHandle");
      break;
    case ReadNotPermitte:
      Serial.println("ReadNotPermitte");
      break;
    case WriteNotPermitted:
      Serial.println("WriteNotPermitted");
      break;
    case InvalidPD:
      Serial.println("InvalidPD");
      break;
    case InsufficientAuthentication:
      Serial.println("InsufficientAuthentication");
      break;
    case RequestNotSupported:
      Serial.println("RequestNotSupported");
      break;
    case InvalidOffset:
      Serial.println("InvalidOffset");
      break;
    case InsufficientAuthorization:
      Serial.println("InsufficientAuthorization");
      break;
    case PrepareQueueFull:
      Serial.println("PrepareQueueFull");
      break;
    case AttributeNotFound:
      Serial.println("AttributeNotFound");
      break;
    case AttributeNotLong:
      Serial.println("AttributeNotLong");
      break;
    case InsufficientEncryptionKeySize:
      Serial.println("InsufficientEncryptionKeySize");
      break;
    case InvalidAttributeValueLength:
      Serial.println("InvalidAttributeValueLength");
      break;
    case UnlikelyError:
      Serial.println("UnlikelyError");
      break;
    case InsufficientEncryption:
      Serial.println("InsufficientEncryption");
      break;
    case UnsupportedGroupType:
      Serial.println("UnsupportedGroupType");
      break;
    case InsufficientResources:
      Serial.println("InsufficientResources");
      break;
    case ApplicationErrorCodes:
      Serial.println("ApplicationErrorCodes");
      break;
    default:
      Serial.println("Invalid error");
      break;
  }
}

/*
 * Function: Converts a string to an array of bytes
 * For example: If the input array -> 23576173706D6F74655F50726F23
 * The output string is str -> #Waspmote_Pro#
 */
uint16_t BLE112::str2hex(char* str, uint8_t* array){

  // get length in bytes (half of ASCII characters)
	uint16_t length=strlen(str)/2;

  // Conversion from ASCII to HEX
  for(uint16_t j=0; j<length; j++){
    array[j] = str2hex(&str[j*2]);
  }

	return length;
}

/*
 * Function: Converts a string to an hex number
 *
 */
uint8_t BLE112::str2hex(uint8_t* str){
	int aux=0, aux2=0;

	if( (*str>='0') && (*str<='9') )
	{
		aux=*str++-'0';
	}
	else if( (*str>='A') && (*str<='F') )
	{
		aux=*str++-'A'+10;
	}
	if( (*str>='0') && (*str<='9') )
	{
		aux2=*str-'0';
	}
	else if( (*str>='A') && (*str<='F') )
	{
		aux2=*str-'A'+10;
	}
	return aux*16+aux2;
}

/*
 * Function: Converts a string to an hex number
 *
 */
uint8_t BLE112::str2hex(char* str){
	int aux=0, aux2=0;


	if( (*str>='0') && (*str<='9') )
	{
		aux=*str++-'0';
	}
	else if( (*str>='A') && (*str<='F') )
	{
		aux=*str++-'A'+10;
	}
	if( (*str>='0') && (*str<='9') )
	{
		aux2=*str-'0';
	}
	else if( (*str>='A') && (*str<='F') )
	{
		aux2=*str-'A'+10;
	}
	return aux*16+aux2;
}
